marinetechsys/pio-freertos-rp/lib/FreeRTOS-Kernel/portable/ThirdParty/GCC/RP2040/port.c
    /* And explicitly clear any other IRQ flags. */
    multicore_fifo_clear_irq();

#if ( portRUNNING_ON_BOTH_CORES == 1 )
    portYIELD_FROM_ISR( pdTRUE );
#elif ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    uint32_t ulSave = spin_lock_blocking( pxCrossCoreSpinLock );
    EventBits_t ulBits = uxCrossCoreEventBits;
    uxCrossCoreEventBits &= ~ulBits;
    spin_unlock( pxCrossCoreSpinLock, ulSave );
    xEventGroupSetBitsFromISR( xEventGroup, ulBits, &xHigherPriorityTaskWoken );
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif /* portRUNNING_ON_BOTH_CORES */
}
#endif /* if ( LIB_PICO_MULTICORE == 1 ) && ( configSUPPORT_PICO_SYNC_INTEROP == 1 ) */

#if ( configNUMBER_OF_CORES > 1 )

/*
* See header file for description.
 */
static BaseType_t xPortStartSchedulerOnCore()
{
    if( ucPrimaryCoreNum == get_core_num() )
    {
        /* Start the timer that generates the tick ISR.  Interrupts are disabled
            * here already. */
        vPortSetupTimerInterrupt();

        /* Make PendSV, CallSV and SysTick the same priority as the kernel. */
        portNVIC_SHPR3_REG |= portNVIC_SYSTICK_PRI;
#if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
        exception_set_exclusive_handler( SYSTICK_EXCEPTION, xPortSysTickHandler );
#endif
    }

    portNVIC_SHPR3_REG |= portNVIC_PENDSV_PRI;

#if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
    exception_set_exclusive_handler( PENDSV_EXCEPTION, xPortPendSVHandler );
    exception_set_exclusive_handler( SVCALL_EXCEPTION, vPortSVCHandler );
#endif

    /* Install FIFO handler to receive interrupt from other core */
    multicore_fifo_clear_irq();
    multicore_fifo_drain();
    uint32_t ulIRQNum = SIO_IRQ_PROC0 + get_core_num();
    irq_set_priority( ulIRQNum, portMIN_INTERRUPT_PRIORITY );
    irq_set_exclusive_handler( ulIRQNum, prvFIFOInterruptHandler );
    irq_set_enabled( ulIRQNum, 1 );

    /* Start the first task. */
    vPortStartFirstTask();

    /* Should never get here as the tasks will now be executing!  Call the task
        * exit error function to prevent compiler warnings about a static function
        * not being called in the case that the application writer overrides this
        * functionality by defining configTASK_RETURN_ADDRESS.  Call
        * vTaskSwitchContext() so link time optimisation does not remove the
        * symbol. */
    vTaskSwitchContext( portGET_CORE_ID() );
    prvTaskExitError();

    /* Should not get here! */
    return 0;
}

#if portRUNNING_ON_BOTH_CORES
static void prvDisableInterruptsAndPortStartSchedulerOnCore( void )
{
    portDISABLE_INTERRUPTS();
    xPortStartSchedulerOnCore();
}
#endif

/*
* See header file for description.
 */
BaseType_t xPortStartScheduler( void )
{
    configASSERT( ucPrimaryCoreNum == INVALID_PRIMARY_CORE_NUM );

    /* No one else should use these! */
    spin_lock_claim( configSMP_SPINLOCK_0 );
    spin_lock_claim( configSMP_SPINLOCK_1 );

#if portRUNNING_ON_BOTH_CORES
    ucPrimaryCoreNum = configTICK_CORE;
    configASSERT( get_core_num() == 0 ); /* we must be started on core 0 */
    multicore_launch_core1( prvDisableInterruptsAndPortStartSchedulerOnCore );
#else
    ucPrimaryCoreNum = get_core_num();
#endif
    xPortStartSchedulerOnCore();

    /* Should not get here! */
    return 0;
}

#else /* if ( configNUMBER_OF_CORES > 1 ) */

/*
* See header file for description.
 */
BaseType_t xPortStartScheduler( void )
{
    /* Make PendSV, CallSV and SysTick the same priority as the kernel. */
    portNVIC_SHPR3_REG |= portNVIC_PENDSV_PRI;
    portNVIC_SHPR3_REG |= portNVIC_SYSTICK_PRI;

#if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
    exception_set_exclusive_handler( PENDSV_EXCEPTION, xPortPendSVHandler );
    exception_set_exclusive_handler( SYSTICK_EXCEPTION, xPortSysTickHandler );
    exception_set_exclusive_handler( SVCALL_EXCEPTION, vPortSVCHandler );
#endif

    /* Start the timer that generates the tick ISR.  Interrupts are disabled
        * here already. */
    vPortSetupTimerInterrupt();

    /* Initialise the critical nesting count ready for the first task. */
    uxCriticalNesting = 0;

    ucPrimaryCoreNum = get_core_num();
#if ( LIB_PICO_MULTICORE == 1 )
#if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
    multicore_fifo_clear_irq();
    multicore_fifo_drain();
    uint32_t irq_num = 15 + get_core_num();
    irq_set_priority( irq_num, portMIN_INTERRUPT_PRIORITY );
    irq_set_exclusive_handler( irq_num, prvFIFOInterruptHandler );
    irq_set_enabled( irq_num, 1 );
#endif
#endif

    /* Start the first task. */
    vPortStartFirstTask();

    /* Should never get here as the tasks will now be executing!  Call the task
        * exit error function to prevent compiler warnings about a static function
        * not being called in the case that the application writer overrides this
        * functionality by defining configTASK_RETURN_ADDRESS.  Call
        * vTaskSwitchContext() so link time optimisation does not remove the
        * symbol. */
    vTaskSwitchContext();
    prvTaskExitError();

    /* Should not get here! */
    return 0;
}
#endif /* if ( configNUMBER_OF_CORES > 1 ) */

/*-----------------------------------------------------------*/

void vPortEndScheduler( void )
{
    /* Not implemented in ports where there is nothing to return to. */
    panic_unsupported();
}
/*-----------------------------------------------------------*/

void vPortYield( void )
{
#if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )

    /* We are not in an ISR, and pxYieldSpinLock is always dealt with and
        * cleared when interrupts are re-enabled, so should be NULL */
    configASSERT( pxYieldSpinLock[ portGET_CORE_ID() ] == NULL );
#endif /* configSUPPORT_PICO_SYNC_INTEROP */

    /* Set a PendSV to request a context switch. */
    portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;

    /* Barriers are normally not required but do ensure the code is completely
    * within the specified behaviour for the architecture. */
    __asm volatile ( "dsb" ::: "memory" );
    __asm volatile ( "isb" );
}

/*-----------------------------------------------------------*/

#if ( configNUMBER_OF_CORES == 1 )
void vPortEnterCritical( void )
{
    portDISABLE_INTERRUPTS();
    uxCriticalNesting++;
    __asm volatile ( "dsb" ::: "memory" );
    __asm volatile ( "isb" );
}
#endif /* #if ( configNUMBER_OF_CORES == 1 ) */
/*-----------------------------------------------------------*/

#if ( configNUMBER_OF_CORES == 1 )
void vPortExitCritical( void )
{
    configASSERT( uxCriticalNesting );
    uxCriticalNesting--;

    if( uxCriticalNesting == 0 )
    {
        portENABLE_INTERRUPTS();
    }
}
#endif /* #if ( configNUMBER_OF_CORES == 1 ) */

void vPortEnableInterrupts( void )
{
#if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
    int xCoreID = ( int ) portGET_CORE_ID();

    if( pxYieldSpinLock[ xCoreID ] )
    {
        spin_lock_t * const pxTmpLock = pxYieldSpinLock[ xCoreID ];
        pxYieldSpinLock[ xCoreID ] = NULL;
        spin_unlock( pxTmpLock, ulYieldSpinLockSaveValue[ xCoreID ] );
    }
#endif
    __asm volatile ( " cpsie i " ::: "memory" );
}

/*-----------------------------------------------------------*/

uint32_t ulSetInterruptMaskFromISR( void )
{
    __asm volatile (
        " mrs r0, PRIMASK    \n"
        " cpsid i            \n"
        " bx lr                "
        ::: "memory"
    );
}
/*-----------------------------------------------------------*/

void vClearInterruptMaskFromISR( __attribute__( ( unused ) ) uint32_t ulMask )
{
    __asm volatile (
        " msr PRIMASK, r0    \n"
        " bx lr                "
        ::: "memory"
    );
}

/*-----------------------------------------------------------*/

