marinetechsys/pio-freertos-rp/lib/FreeRTOS-Kernel/portable/ThirdParty/GCC/RP2040/port.c
/*
* Setup the systick timer to generate the tick interrupts at the required
* frequency.
 */
__attribute__( ( weak ) ) void vPortSetupTimerInterrupt( void )
{
/* Calculate the constants required to configure the tick interrupt. */
#if ( configUSE_TICKLESS_IDLE == 1 )
    {
        ulTimerCountsForOneTick = ( clock_get_hz( clk_sys ) / configTICK_RATE_HZ );
        xMaximumPossibleSuppressedTicks = portMAX_24_BIT_NUMBER / ulTimerCountsForOneTick;
        ulStoppedTimerCompensation = portMISSED_COUNTS_FACTOR;
    }
#endif /* configUSE_TICKLESS_IDLE */

    /* Stop and reset the SysTick. */
    portNVIC_SYSTICK_CTRL_REG = 0UL;
    portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;

    /* Configure SysTick to interrupt at the requested rate. */
    portNVIC_SYSTICK_LOAD_REG = ( clock_get_hz( clk_sys ) / configTICK_RATE_HZ ) - 1UL;
    portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;
}
/*-----------------------------------------------------------*/

#if ( configUSE_TICKLESS_IDLE == 1 )
__attribute__( ( weak ) ) void vPortSuppressTicksAndSleep(TickType_t xExpectedIdleTime)
{
    uint32_t ulReloadValue, ulCompleteTickPeriods, ulCompletedSysTickDecrements, ulSysTickDecrementsLeft;
    TickType_t xModifiableIdleTime;

    /* Make sure the SysTick reload value does not overflow the counter. */
    if( xExpectedIdleTime > xMaximumPossibleSuppressedTicks )
    {
        xExpectedIdleTime = xMaximumPossibleSuppressedTicks;
    }

    /* Enter a critical section but don't use the taskENTER_CRITICAL()
        * method as that will mask interrupts that should exit sleep mode. */
    __asm volatile ( "cpsid i" ::: "memory" );
    __asm volatile ( "dsb" );
    __asm volatile ( "isb" );

    /* If a context switch is pending or a task is waiting for the scheduler
        * to be unsuspended then abandon the low power entry. */
    if( eTaskConfirmSleepModeStatus() == eAbortSleep )
    {
        /* Re-enable interrupts - see comments above the cpsid instruction
            * above. */
        __asm volatile ( "cpsie i" ::: "memory" );
    }
    else
    {
        /* Stop the SysTick momentarily.  The time the SysTick is stopped for
            * is accounted for as best it can be, but using the tickless mode will
            * inevitably result in some tiny drift of the time maintained by the
            * kernel with respect to calendar time. */
        portNVIC_SYSTICK_CTRL_REG = ( portNVIC_SYSTICK_CLK_BIT_CONFIG | portNVIC_SYSTICK_INT_BIT );

        /* Use the SysTick current-value register to determine the number of
            * SysTick decrements remaining until the next tick interrupt.  If the
            * current-value register is zero, then there are actually
            * ulTimerCountsForOneTick decrements remaining, not zero, because the
            * SysTick requests the interrupt when decrementing from 1 to 0. */
        ulSysTickDecrementsLeft = portNVIC_SYSTICK_CURRENT_VALUE_REG;

        if( ulSysTickDecrementsLeft == 0 )
        {
            ulSysTickDecrementsLeft = ulTimerCountsForOneTick;
        }

        /* Calculate the reload value required to wait xExpectedIdleTime
            * tick periods.  -1 is used because this code normally executes part
            * way through the first tick period.  But if the SysTick IRQ is now
            * pending, then clear the IRQ, suppressing the first tick, and correct
            * the reload value to reflect that the second tick period is already
            * underway.  The expected idle time is always at least two ticks. */
        ulReloadValue = ulSysTickDecrementsLeft + ( ulTimerCountsForOneTick * ( xExpectedIdleTime - 1UL ) );

        if( ( portNVIC_INT_CTRL_REG & portNVIC_PEND_SYSTICK_SET_BIT ) != 0 )
        {
            portNVIC_INT_CTRL_REG = portNVIC_PEND_SYSTICK_CLEAR_BIT;
            ulReloadValue -= ulTimerCountsForOneTick;
        }

        if( ulReloadValue > ulStoppedTimerCompensation )
        {
            ulReloadValue -= ulStoppedTimerCompensation;
        }

        /* Sleep until something happens.  configPRE_SLEEP_PROCESSING() can
            * set its parameter to 0 to indicate that its implementation contains
            * its own wait for interrupt or wait for event instruction, and so wfi
            * should not be executed again.  However, the original expected idle
            * time variable must remain unmodified, so a copy is taken. */
#if configSUPPORT_PICO_POWERSAVE >= SUPPORT_PICO_POWERSAVE_LVL2
        /* Set the new reload value. */
        portNVIC_SYSTICK_LOAD_REG = ulReloadValue/(135000/8000*1000);
        clock_configure(clk_sys,
                        CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                        CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_ROSC_CLKSRC,
                        8000, 1000); // Switch to a slower ring oscillator clock
        vreg_set_voltage(VREG_VOLTAGE_0_90); // Reduce core voltage
#elif configSUPPORT_PICO_POWERSAVE >= SUPPORT_PICO_POWERSAVE_LVL1
        /* Set the new reload value. */
        portNVIC_SYSTICK_LOAD_REG = ulReloadValue/12;
        clock_configure(clk_sys,
                        CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                        CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
                        135000, 135000/12); // Restore high-speed system clock
#else
        /* Set the new reload value. */
        portNVIC_SYSTICK_LOAD_REG = ulReloadValue;
        configPRE_SLEEP_PROCESSING( ulReloadValue );
#endif
        /* Clear the SysTick count flag and set the count value back to
            * zero. */
        portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;

        /* Restart SysTick. */
        portNVIC_SYSTICK_CTRL_REG |= portNVIC_SYSTICK_ENABLE_BIT;

        if( xModifiableIdleTime > 0 )
        {
            __asm volatile ( "dsb" ::: "memory" );
            __asm volatile ( "wfi" );
            __asm volatile ( "isb" );
        }

#if configSUPPORT_PICO_POWERSAVE >= SUPPORT_PICO_POWERSAVE_LVL0
        vreg_set_voltage(VREG_VOLTAGE_1_10); // Restore core voltage
        clock_configure(clk_sys,
                        CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                        CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
                        135000, 135000); // Restore high-speed system clock
#else
        configPOST_SLEEP_PROCESSING( ulReloadValue );
#endif

        /* Re-enable interrupts to allow the interrupt that brought the MCU
            * out of sleep mode to execute immediately.  See comments above
            * the cpsid instruction above. */
        __asm volatile ( "cpsie i" ::: "memory" );
        __asm volatile ( "dsb" );
        __asm volatile ( "isb" );

        /* Disable interrupts again because the clock is about to be stopped
            * and interrupts that execute while the clock is stopped will increase
            * any slippage between the time maintained by the RTOS and calendar
            * time. */
        __asm volatile ( "cpsid i" ::: "memory" );
        __asm volatile ( "dsb" );
        __asm volatile ( "isb" );

        /* Disable the SysTick clock without reading the
            * portNVIC_SYSTICK_CTRL_REG register to ensure the
            * portNVIC_SYSTICK_COUNT_FLAG_BIT is not cleared if it is set.  Again,
            * the time the SysTick is stopped for is accounted for as best it can
            * be, but using the tickless mode will inevitably result in some tiny
            * drift of the time maintained by the kernel with respect to calendar
            * time*/
        portNVIC_SYSTICK_CTRL_REG = ( portNVIC_SYSTICK_CLK_BIT_CONFIG | portNVIC_SYSTICK_INT_BIT );

