marinetechsys/pio-freertos-rp/lib/FreeRTOS-Kernel/portable/ThirdParty/GCC/RP2040/port.c
        /* Determine whether the SysTick has already counted to zero. */
        if( ( portNVIC_SYSTICK_CTRL_REG & portNVIC_SYSTICK_COUNT_FLAG_BIT ) != 0 )
        {
            uint32_t ulCalculatedLoadValue;

            /* The tick interrupt ended the sleep (or is now pending), and
                * a new tick period has started.  Reset portNVIC_SYSTICK_LOAD_REG
                * with whatever remains of the new tick period. */
            ulCalculatedLoadValue = ( ulTimerCountsForOneTick - 1UL ) - ( ulReloadValue - portNVIC_SYSTICK_CURRENT_VALUE_REG );

            /* Don't allow a tiny value, or values that have somehow
                * underflowed because the post sleep hook did something
                * that took too long or because the SysTick current-value register
                * is zero. */
            if( ( ulCalculatedLoadValue <= ulStoppedTimerCompensation ) || ( ulCalculatedLoadValue > ulTimerCountsForOneTick ) )
            {
                ulCalculatedLoadValue = ( ulTimerCountsForOneTick - 1UL );
            }

            portNVIC_SYSTICK_LOAD_REG = ulCalculatedLoadValue;

            /* As the pending tick will be processed as soon as this
                * function exits, the tick value maintained by the tick is stepped
                * forward by one less than the time spent waiting. */
            ulCompleteTickPeriods = xExpectedIdleTime - 1UL;
        }
        else
        {
            /* Something other than the tick interrupt ended the sleep. */

            /* Use the SysTick current-value register to determine the
                * number of SysTick decrements remaining until the expected idle
                * time would have ended. */
            ulSysTickDecrementsLeft = portNVIC_SYSTICK_CURRENT_VALUE_REG;
#if ( portNVIC_SYSTICK_CLK_BIT_CONFIG != portNVIC_SYSTICK_CLK_BIT )
            {
                /* If the SysTick is not using the core clock, the current-
                    * value register might still be zero here.  In that case, the
                    * SysTick didn't load from the reload register, and there are
                    * ulReloadValue decrements remaining in the expected idle
                    * time, not zero. */
                if( ulSysTickDecrementsLeft == 0 )
                {
                    ulSysTickDecrementsLeft = ulReloadValue;
                }
            }
#endif /* portNVIC_SYSTICK_CLK_BIT_CONFIG */

            /* Work out how long the sleep lasted rounded to complete tick
                * periods (not the ulReload value which accounted for part
                * ticks). */
            ulCompletedSysTickDecrements = ( xExpectedIdleTime * ulTimerCountsForOneTick ) - ulSysTickDecrementsLeft;

            /* How many complete tick periods passed while the processor
                * was waiting? */
            ulCompleteTickPeriods = ulCompletedSysTickDecrements / ulTimerCountsForOneTick;

            /* The reload value is set to whatever fraction of a single tick
                * period remains. */
            portNVIC_SYSTICK_LOAD_REG = ( ( ulCompleteTickPeriods + 1UL ) * ulTimerCountsForOneTick ) - ulCompletedSysTickDecrements;
        }

        /* Restart SysTick so it runs from portNVIC_SYSTICK_LOAD_REG again,
            * then set portNVIC_SYSTICK_LOAD_REG back to its standard value.  If
            * the SysTick is not using the core clock, temporarily configure it to
            * use the core clock.  This configuration forces the SysTick to load
            * from portNVIC_SYSTICK_LOAD_REG immediately instead of at the next
            * cycle of the other clock.  Then portNVIC_SYSTICK_LOAD_REG is ready
            * to receive the standard value immediately. */
        portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;
        portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;
#if ( portNVIC_SYSTICK_CLK_BIT_CONFIG == portNVIC_SYSTICK_CLK_BIT )
        {
            portNVIC_SYSTICK_LOAD_REG = ulTimerCountsForOneTick - 1UL;
        }
#else
        {
            /* The temporary usage of the core clock has served its purpose,
                * as described above.  Resume usage of the other clock. */
            portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT;

            if( ( portNVIC_SYSTICK_CTRL_REG & portNVIC_SYSTICK_COUNT_FLAG_BIT ) != 0 )
            {
                /* The partial tick period already ended.  Be sure the SysTick
                    * counts it only once. */
                portNVIC_SYSTICK_CURRENT_VALUE_REG = 0;
            }

            portNVIC_SYSTICK_LOAD_REG = ulTimerCountsForOneTick - 1UL;
            portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT_CONFIG | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT;
        }
#endif /* portNVIC_SYSTICK_CLK_BIT_CONFIG */

        /* Step the tick to account for any tick periods that elapsed. */
        vTaskStepTick( ulCompleteTickPeriods );

        /* Exit with interrupts enabled. */
        __asm volatile ( "cpsie i" ::: "memory" );
    }
}

#endif /* configUSE_TICKLESS_IDLE */

#if ( configSUPPORT_PICO_SYNC_INTEROP == 1 ) || ( configSUPPORT_PICO_TIME_INTEROP == 1 )
static TickType_t prvGetTicksToWaitBefore( absolute_time_t t )
{
    int64_t xDelayUs = absolute_time_diff_us(get_absolute_time(), t);
    const uint32_t ulTickPeriodUs = 1000000 / configTICK_RATE_HZ;

    // Clamp negative delays (target time has passed)
    if (xDelayUs <= 0)
    {
        return 0;
    }

    // Subtract one tick period to avoid oversleeping
    if (xDelayUs > (int64_t)ulTickPeriodUs)
    {
        xDelayUs -= ulTickPeriodUs;
    }
    else
    {
        return 0;
    }

    // Convert microseconds to ticks (rounding down)
    return (TickType_t)(xDelayUs / ulTickPeriodUs);
}
#endif /* if ( configSUPPORT_PICO_SYNC_INTEROP == 1 ) || ( configSUPPORT_PICO_TIME_INTEROP == 1 ) */

#if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
uint32_t ulPortLockGetCurrentOwnerId()
{
    if( portIS_FREE_RTOS_CORE() )
    {
        uint32_t exception = __get_current_exception();

