marinetechsys/pio-freertos-rp/lib/FreeRTOS-Kernel/portable/ThirdParty/GCC/RP2040/port.c
        if( !exception )
        {
            return ( uintptr_t ) xTaskGetCurrentTaskHandle();
        }

        /* Note: since ROM as at 0x00000000, these can't be confused with
            * valid task handles (pointers) in RAM */
        /* We make all exception handler/core combinations distinct owners */
        return get_core_num() + exception * 2;
    }

    /* Note: since ROM as at 0x00000000, this can't be confused with
        * valid task handles (pointers) in RAM */
    return get_core_num();
}

static inline EventBits_t prvGetEventGroupBit( spin_lock_t * spinLock )
{
    uint32_t ulBit;

#if ( configTICK_TYPE_WIDTH_IN_BITS == TICK_TYPE_WIDTH_16_BITS )
    ulBit = 1u << ( spin_lock_get_num( spinLock ) & 0x7u );
#elif ( configTICK_TYPE_WIDTH_IN_BITS == TICK_TYPE_WIDTH_32_BITS )
    ulBit = 1u << spin_lock_get_num( spinLock );
    /* reduce to range 0-24 */
    ulBit |= ulBit << 8u;
    ulBit >>= 8u;
#endif /* configTICK_TYPE_WIDTH_IN_BITS */
    return ( EventBits_t ) ulBit;
}

static inline EventBits_t prvGetAllEventGroupBits()
{
#if ( configTICK_TYPE_WIDTH_IN_BITS == TICK_TYPE_WIDTH_16_BITS )
    return ( EventBits_t ) 0xffu;
#elif ( configTICK_TYPE_WIDTH_IN_BITS == TICK_TYPE_WIDTH_32_BITS )
    return ( EventBits_t ) 0xffffffu;
#endif /* configTICK_TYPE_WIDTH_IN_BITS */
}

void vPortLockInternalSpinUnlockWithWait( struct lock_core * pxLock,
                                         uint32_t ulSave )
{
    configASSERT( !portCHECK_IF_IN_ISR() );

    /* note no need to check LIB_PICO_MULTICORE, as this is always returns true if that is not defined */
    if( !portIS_FREE_RTOS_CORE() )
    {
        spin_unlock( pxLock->spin_lock, ulSave );
        __wfe();
    }
    else
    {
        configASSERT( pxYieldSpinLock[ portGET_CORE_ID() ] == NULL );

        /* we want to hold the lock until the event bits have been set; since interrupts are currently disabled */
        /* by the spinlock, we can defer until portENABLE_INTERRUPTS is called which is always called when */
        /* the scheduler is unlocked during this call */
        configASSERT( pxLock->spin_lock );
        int xCoreID = ( int ) portGET_CORE_ID();
        pxYieldSpinLock[ xCoreID ] = pxLock->spin_lock;
        ulYieldSpinLockSaveValue[ xCoreID ] = ulSave;
        xEventGroupWaitBits( xEventGroup, prvGetEventGroupBit( pxLock->spin_lock ),
                            pdTRUE, pdFALSE, portMAX_DELAY );
    }
}

void vPortLockInternalSpinUnlockWithNotify( struct lock_core * pxLock,
                                           uint32_t ulSave )
{
    EventBits_t uxBits = prvGetEventGroupBit( pxLock->spin_lock );

    if( portIS_FREE_RTOS_CORE() )
    {
#if LIB_PICO_MULTICORE
        /* signal an event in case a regular core is waiting */
        __sev();
#endif
        spin_unlock( pxLock->spin_lock, ulSave );

        if( !portCHECK_IF_IN_ISR() )
        {
            xEventGroupSetBits( xEventGroup, uxBits );
        }
        else
        {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xEventGroupSetBitsFromISR( xEventGroup, uxBits, &xHigherPriorityTaskWoken );
            portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
        }
    }
    else
    {
        __sev();
#if ( portRUNNING_ON_BOTH_CORES == 0 )

        /* We could sent the bits across the FIFO which would have required us to block here if the FIFO was full,
                * or we could have just set all bits on the other side, however it seems reasonable instead to take
                * the hit of another spin lock to protect an accurate bit set. */
        if( pxCrossCoreSpinLock != pxLock->spin_lock )
        {
            spin_lock_unsafe_blocking( pxCrossCoreSpinLock );
            uxCrossCoreEventBits |= uxBits;
            spin_unlock_unsafe( pxCrossCoreSpinLock );
        }
        else
        {
            uxCrossCoreEventBits |= uxBits;
        }

        /* This causes fifo irq on the other (FreeRTOS) core which will do the set the event bits */
        sio_hw->fifo_wr = 0;
#endif /* portRUNNING_ON_BOTH_CORES == 0 */
        spin_unlock( pxLock->spin_lock, ulSave );
    }
}

bool xPortLockInternalSpinUnlockWithBestEffortWaitOrTimeout( struct lock_core * pxLock,
                                                            uint32_t ulSave,
                                                            absolute_time_t uxUntil )
{
    configASSERT( !portCHECK_IF_IN_ISR() );

    /* note no need to check LIB_PICO_MULTICORE, as this is always returns true if that is not defined */
    if( !portIS_FREE_RTOS_CORE() )
    {
        spin_unlock( pxLock->spin_lock, ulSave );
        return best_effort_wfe_or_timeout( uxUntil );
    }
    else
    {
        configASSERT( portIS_FREE_RTOS_CORE() );
        configASSERT( pxYieldSpinLock[ portGET_CORE_ID() ] == NULL );

        TickType_t uxTicksToWait = prvGetTicksToWaitBefore( uxUntil );

        if( uxTicksToWait )
        {
            /* We want to hold the lock until the event bits have been set; since interrupts are currently disabled
                * by the spinlock, we can defer until portENABLE_INTERRUPTS is called which is always called when
                * the scheduler is unlocked during this call */
            configASSERT( pxLock->spin_lock );
            int xCoreID = ( int ) portGET_CORE_ID();
            pxYieldSpinLock[ xCoreID ] = pxLock->spin_lock;
            ulYieldSpinLockSaveValue[ xCoreID ] = ulSave;
            xEventGroupWaitBits( xEventGroup,
                                prvGetEventGroupBit( pxLock->spin_lock ), pdTRUE,
                                pdFALSE, uxTicksToWait );
        }
        else
        {
            spin_unlock( pxLock->spin_lock, ulSave );
        }

        if( time_reached( uxUntil ) )
        {
            return true;
        }
        else
        {
            /* We do not want to hog the core */
            portYIELD();
            /* We aren't sure if we've reached the timeout yet; the caller will check */
            return false;
        }
    }
}

#if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
/* runs before main */
static void __attribute__( ( constructor ) ) prvRuntimeInitializer( void )
{
/* This must be done even before the scheduler is started, as the spin lock
            * is used by the overrides of the SDK wait/notify primitives */
#if ( portRUNNING_ON_BOTH_CORES == 0 )
    pxCrossCoreSpinLock = spin_lock_instance( next_striped_spin_lock_num() );
#endif /* portRUNNING_ON_BOTH_CORES */

/* The event group is not used prior to scheduler init, but is initialized
            * here to since it logically belongs with the spin lock */
#if ( configSUPPORT_STATIC_ALLOCATION == 1 )
    xEventGroup = xEventGroupCreateStatic( &xStaticEventGroup );
#else

    /* Note that it is slightly dubious calling this here before the scheduler is initialized,
                * however the only thing it touches is the allocator which then calls vPortEnterCritical
                * and vPortExitCritical, and allocating here saves us checking the one time initialized variable in
                * some rather critical code paths */
    xEventGroup = xEventGroupCreate();
#endif /* configSUPPORT_STATIC_ALLOCATION */
}
#endif /* if ( configSUPPORT_PICO_SYNC_INTEROP == 1 ) */
#endif /* configSUPPORT_PICO_SYNC_INTEROP */

#if ( configSUPPORT_PICO_TIME_INTEROP == 1 )
void xPortSyncInternalYieldUntilBefore( absolute_time_t t )
{
    TickType_t uxTicksToWait = prvGetTicksToWaitBefore( t );

    if( uxTicksToWait )
    {
        vTaskDelay( uxTicksToWait );
    }
}
#endif /* configSUPPORT_PICO_TIME_INTEROP */
